In [39]:
import pandas as pd

data = [[1, 'Joe'], [2, 'Henry'], [3, 'Sam'], [4, 'Max']]
customers = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})
#customers = customers.set_index("id")
data = [[1, 3], [2, 1]]
orders = pd.DataFrame(data, columns=['id', 'customerId']).astype({'id':'Int64', 'customerId':'Int64'})
#orders = orders.set_index("id")

In [40]:
customers.head()

   id   name
0   1    Joe
1   2  Henry
2   3    Sam
3   4    Max

In [41]:
orders.head()

   id  customerId
0   1           3
1   2           1

In [42]:
new_df = pd.DataFrame()
new_df = customers.loc[orders["customerId"]]
new_df.head()

   id   name
3   4    Max
1   2  Henry

In [43]:
new_df["name"]

3      Max
1    Henry
Name: name, dtype: object

---

In [44]:
df = customers[~customers['id'].isin(orders["customerId"])].rename(columns={'name':'Customers'})

In [45]:
df.head()

   id Customers
1   2     Henry
3   4       Max